spec/cassettes/Payment/make_a_payment/makes_a_successful_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - '*'
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Jul 2014 16:40:03 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM83dd729c020711e4ab2502a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTVVhWAwQDVUYdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKAQVTV1UACgJWVVADAgZQUB0WAVBQT0ISBA1SC1wBC1dQDlNXVlVVVxQbQQACVEBVOQ==
      Content-Length:
      - '1291'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-02T16:40:03.524107Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-02T16:40:03.524111Z",
              "href": "/bank_accounts/BA41AQyfb3PRKriXzCB98hq5",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA41AQyfb3PRKriXzCB98hq5"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Jul 2014 16:40:03 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA41AQyfb3PRKriXzCB98hq5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Jul 2014 16:40:04 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM848f5a84020711e48ad106429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '500'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-02T16:40:03.524107Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-02T16:40:03.524111Z",
              "href": "/bank_accounts/BA41AQyfb3PRKriXzCB98hq5",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA41AQyfb3PRKriXzCB98hq5"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Jul 2014 16:40:04 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA41AQyfb3PRKriXzCB98hq5/verifications
    body:
      encoding: UTF-8
      string: '{}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Jul 2014 16:40:10 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM84ce1936020711e4ac8902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA41AQyfb3PRKriXzCB98hq5"
              },
              "href": "/verifications/BZ48HYpFkQY86DrkZ2gWVjO5",
              "created_at": "2014-07-02T16:40:09.848714Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-02T16:40:10.154911Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ48HYpFkQY86DrkZ2gWVjO5"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Jul 2014 16:40:10 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ48HYpFkQY86DrkZ2gWVjO5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Jul 2014 16:40:11 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM88bdcbae020711e4ac8902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA41AQyfb3PRKriXzCB98hq5"
              },
              "href": "/verifications/BZ48HYpFkQY86DrkZ2gWVjO5",
              "created_at": "2014-07-02T16:40:09.848714Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-02T16:40:10.154911Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ48HYpFkQY86DrkZ2gWVjO5"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Jul 2014 16:40:11 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ48HYpFkQY86DrkZ2gWVjO5
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BA41AQyfb3PRKriXzCB98hq5"},"created_at":"2014-07-02T16:40:09.848714Z","attempts_remaining":3,"updated_at":"2014-07-02T16:40:10.154911Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZ48HYpFkQY86DrkZ2gWVjO5","amount_1":1,"amount_2":1}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Jul 2014 16:40:11 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM890b42a8020711e4b7da06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '601'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BA41AQyfb3PRKriXzCB98hq5"
              },
              "href": "/verifications/BZ48HYpFkQY86DrkZ2gWVjO5",
              "created_at": "2014-07-02T16:40:09.848714Z",
              "attempts_remaining": 2,
              "updated_at": "2014-07-02T16:40:11.578590Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZ48HYpFkQY86DrkZ2gWVjO5"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Jul 2014 16:40:11 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA41AQyfb3PRKriXzCB98hq5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Jul 2014 16:40:11 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM89453864020711e48ad106429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '524'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ48HYpFkQY86DrkZ2gWVjO5"
              },
              "can_credit": true,
              "created_at": "2014-07-02T16:40:03.524107Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-02T16:40:11.576597Z",
              "href": "/bank_accounts/BA41AQyfb3PRKriXzCB98hq5",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BA41AQyfb3PRKriXzCB98hq5"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Jul 2014 16:40:11 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA41AQyfb3PRKriXzCB98hq5/debits
    body:
      encoding: UTF-8
      string: '{"amount":100,"appears_on_statement_as":"Epicodus Tuition","description":"Some
        descriptive text for the debit in the dashboard"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Jul 2014 16:40:12 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM89836968020711e48ad106429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '1031'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": "Some descriptive text for the debit in the dashboard",
              "links": {
                "customer": null,
                "source": "BA41AQyfb3PRKriXzCB98hq5",
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-07-02T16:40:12.587191Z",
              "created_at": "2014-07-02T16:40:12.344372Z",
              "transaction_number": "W558-229-5845",
              "failure_reason": null,
              "currency": "USD",
              "amount": 100,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD4bwv02rFddqwyEkbFfitM5",
              "appears_on_statement_as": "BAL*Epicodus Tuition",
              "id": "WD4bwv02rFddqwyEkbFfitM5"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.order": "/orders/{debits.order}",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.events": "/debits/{debits.id}/events"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Jul 2014 16:40:12 GMT
recorded_with: VCR 2.9.2
