spec/cassettes/Payment/make_a_payment_with_a_bank_account/makes_a_successful_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=example%40example.com
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Content-Length:
      - '27'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '869'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_1Vcm8HnmG1po5M
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_C6PFQzAftUE6Cb",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/bank_accounts"
          },
          "created": 1515463306,
          "currency": null,
          "default_bank_account": null,
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "example@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/subscriptions"
          },
          "default_source_type": null
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:46 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_C6PFQzAftUE6Cb/sources
    body:
      encoding: UTF-8
      string: source[object]=bank_account&source[country]=US&source[account_number]=000123456789&source[routing_number]=110000000
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Content-Length:
      - '115'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:47 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '375'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_lsmvdercjYxDI0
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_C6PFYOYlTaYOvo",
          "object": "bank_account",
          "account_holder_name": null,
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_C6PFQzAftUE6Cb",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "routing_number": "110000000",
          "status": "new",
          "name": null
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:47 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_C6PFQzAftUE6Cb
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:47 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1861'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_NXUIaqu78aT223
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_C6PFQzAftUE6Cb",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [
              {
                "id": "ba_C6PFYOYlTaYOvo",
                "object": "bank_account",
                "account_holder_name": null,
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_C6PFQzAftUE6Cb",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "routing_number": "110000000",
                "status": "new",
                "name": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/bank_accounts"
          },
          "created": 1515463306,
          "currency": null,
          "default_bank_account": "ba_C6PFYOYlTaYOvo",
          "default_source": "ba_C6PFYOYlTaYOvo",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "example@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "ba_C6PFYOYlTaYOvo",
                "object": "bank_account",
                "account_holder_name": null,
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_C6PFQzAftUE6Cb",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "routing_number": "110000000",
                "status": "new",
                "name": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/subscriptions"
          },
          "default_source_type": "bank_account"
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:47 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_C6PFQzAftUE6Cb/sources/ba_C6PFYOYlTaYOvo
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:47 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '375'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7lw0RGtsPI1mPr
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_C6PFYOYlTaYOvo",
          "object": "bank_account",
          "account_holder_name": null,
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_C6PFQzAftUE6Cb",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "routing_number": "110000000",
          "status": "new",
          "name": null
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:47 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_C6PFQzAftUE6Cb
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:47 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1861'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_aYmctn0hjox35R
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_C6PFQzAftUE6Cb",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [
              {
                "id": "ba_C6PFYOYlTaYOvo",
                "object": "bank_account",
                "account_holder_name": null,
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_C6PFQzAftUE6Cb",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "routing_number": "110000000",
                "status": "new",
                "name": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/bank_accounts"
          },
          "created": 1515463306,
          "currency": null,
          "default_bank_account": "ba_C6PFYOYlTaYOvo",
          "default_source": "ba_C6PFYOYlTaYOvo",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "example@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "ba_C6PFYOYlTaYOvo",
                "object": "bank_account",
                "account_holder_name": null,
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_C6PFQzAftUE6Cb",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "routing_number": "110000000",
                "status": "new",
                "name": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/subscriptions"
          },
          "default_source_type": "bank_account"
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:47 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_C6PFQzAftUE6Cb/sources/ba_C6PFYOYlTaYOvo/verify
    body:
      encoding: UTF-8
      string: amounts[]=32&amounts[]=45
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Content-Length:
      - '25'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:48 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '380'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_sZXR4VhdWnOiTU
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_C6PFYOYlTaYOvo",
          "object": "bank_account",
          "account_holder_name": null,
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_C6PFQzAftUE6Cb",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "routing_number": "110000000",
          "status": "verified",
          "name": null
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:48 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_C6PFQzAftUE6Cb
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:48 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1871'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_LuLnfMusVKJZjD
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_C6PFQzAftUE6Cb",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [
              {
                "id": "ba_C6PFYOYlTaYOvo",
                "object": "bank_account",
                "account_holder_name": null,
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_C6PFQzAftUE6Cb",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "routing_number": "110000000",
                "status": "verified",
                "name": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/bank_accounts"
          },
          "created": 1515463306,
          "currency": null,
          "default_bank_account": "ba_C6PFYOYlTaYOvo",
          "default_source": "ba_C6PFYOYlTaYOvo",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "example@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "ba_C6PFYOYlTaYOvo",
                "object": "bank_account",
                "account_holder_name": null,
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_C6PFQzAftUE6Cb",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "routing_number": "110000000",
                "status": "verified",
                "name": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_C6PFQzAftUE6Cb/subscriptions"
          },
          "default_source_type": "bank_account"
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:48 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=100&currency=usd&customer=cus_C6PFQzAftUE6Cb&source=ba_C6PFYOYlTaYOvo&description=Philadelphia%3B+2018-01-08%3B+Full-time%3B+upfront%3B+example%40example.com
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        server-pdx 15.6.0 Darwin Kernel Version 15.6.0: Mon Nov 13 21:58:35 PST 2017;
        root:xnu-3248.72.11~1/RELEASE_X86_64 x86_64","hostname":"server-pdx"}'
      Content-Length:
      - '164'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Jan 2018 02:01:50 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1560'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Pmrl1mskNnjX6D
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "py_C6PFItKdTkSUVe",
          "object": "charge",
          "amount": 100,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "balance_transaction": "txn_C6PF3iBTPoOkpr",
          "captured": true,
          "created": 1515463308,
          "currency": "usd",
          "customer": "cus_C6PFQzAftUE6Cb",
          "description": "Philadelphia; 2018-01-08; Full-time; upfront; example@example.com",
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": false,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/py_C6PFItKdTkSUVe/refunds"
          },
          "review": null,
          "shipping": null,
          "source": {
            "id": "ba_C6PFYOYlTaYOvo",
            "object": "bank_account",
            "account_holder_name": null,
            "account_holder_type": null,
            "bank_name": "STRIPE TEST BANK",
            "country": "US",
            "currency": "usd",
            "customer": "cus_C6PFQzAftUE6Cb",
            "fingerprint": "qw2YdYDmIJUuNi9w",
            "last4": "6789",
            "metadata": {},
            "routing_number": "110000000",
            "status": "verified",
            "name": null
          },
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "pending",
          "transfer_group": null
        }
    http_version: 
  recorded_at: Tue, 09 Jan 2018 02:01:50 GMT
recorded_with: VCR 4.0.0
